#ifndef POINTS_CPP
#define POINTS_CPP

#include "points.h"
////////////////////////////////////////////////////////////////////////////////
Point::Point()
{
	point	= 0;
	rats	= 0;
	sum		= 0;
	varible	= 1000;
}
/*----------------------------------ВВОД--------------------------------------*/
void Point::cininfo(int& point, int& rats)	// Ввод кол-ва очков и крыс
{
	cout << "Введите сумму умений/кол-во одного умения: ";
	cin >>	point;
	
	cout << "Введите кол-во крыс, которое хотите скрестить: ";
	cin >>	rats;
}
/*----------------------------------ПОДСЧЕТ-----------------------------------*/
void Point::count() // Подсчет
{
	cininfo(point, rats);

	int step	= 0;	// шаг итераций
	int sumiter	= 0;	// сумма итераций	

	sum = point/rats;	// Делим очки на кол-во крыс
	
	for(; step<=varible; step++)	// итерация от 1 до 15
	{	
		sumiter+=step; 
		if(sum <= sumiter)	// если сумма меньше или равна сумме итераций
			break;			// то выходим из цикла
	}
	cout << "Вкладываете по " << step << endl;
}
/*----------------------------------ВЫВОД-------------------------------------*/
void Point::show()
{
	cout << "\n\t***Калькулятор для игры \"Крысы Онлайн\"***" << endl;
	count();
	cout << "---------------------------------------------------------" << endl;
}

#endif
